docs/seminars/mhm/index.org
#+title: Mixed Hodge Modules Learning Seminar
#+options: *:t

*Please volunteer for speaking in FIRST or the MHM seminar.*

* Calendar (FIRST + MHM)

Used to be a google calendar; now defunct. 

* List of talks and references 


1. Overview of mixed Hodge modules and their applications to geometry (Ben)  
   [[file:mhm1.pdf][Notes]] 

2. Classical (pure) Hodge theory (Anand)  
   References: Chapter 0 of [Sabbah-Schnell].  
   [[file:mhm2-asilata.pdf][Notes 1]], [[file:mhm2-anand.pdf][Notes 2]]
   
3. D-modules and the Riemann--Hilbert correspondence (Asilata)  
   References: [Cavazzani] and the references cited there.  
   [[file:mhm3.pdf][Notes]]
   
4. Perverse sheaves (Nicola)   
   
5. Nearby and vanishing cycles (Anand)  
   References: [Sabbah].  
   [[file:mhm4.pdf][Notes]]

6. Degenerations of VHS on curves (Ben)
   [[file:mhm5.pdf][Notes]]

7. Perverse sheaves and the decomposition theorem  
   References: [Achar], [deCataldo-Migliorini], [deCataldo], Chapter 8 of [Hotta-Takeuchi-Tanisaki].  

8. Nearby and vanishing cycles and filtered D-modules  
   References: Section 9 of [Schnell], Section 2.4 of [Sabbah-2]

9. Definition of pure Hodge modules  
   References: Section 12 of [Schnell] which uses stuff also from Section 10 and 11.

10. Generic vanishing theory via mixed Hodge modules
    References: [Popa-Schnell-1]


* References

1. [Sabbah-Schnell]: [[http://www.cmls.polytechnique.fr/perso/sabbah/MHMProject/mhm.html][Sabbah, Schnell, *The MHM project*]]
2. [Achar]: [[file:psln.pdf][Achar: *Lecture notes on Perverse sheaves*]]
3. [Popa-Schnell-1]: [[file:mhmgv.pdf][Popa, Schnell, *Generic vanishing theory via mixed Hodge modules*]]
4. [deCataldo-Migliorini]: [[file:dcm.pdf][de Cataldo, Migliorini, *The decomposition theorem, perverse sheaves, and the topology of algebraic maps*]]
5. [deCataldo]: [[file:Cataldo.pdf][de Cataldo, *Perverse sheaves in algebraic geometry*]]
6. [Hotta-Takeuchi-Tanisaki]: [[file:hottaetal.pdf][Hotta, Takeuchi, Tanisaki *D-modules, perverse sheaves, and representation theory*]]
7. [Cavazzani]: [[file:D-modules.pdf][Cavazzani, *The Riemann--Hilbert correspondence*]]
8. [Schnell]: [[file:sanya.pdf][Schnell, *An overview of Morihiko Saito's theory of mixed Hodge modules*]]
9. [Sabbah]: [[file:sabbah_notredame1305.pdf][Sabbah, *Vanishing cycles and their algebraic computation*]]
10. [Sabbah-2]: [[file:sabbah_luminy07.pdf][Sabbah, *Hodge theory, singularities, and D-modules*]]
