docs/seminars/mhm/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-30 Sat 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mixed Hodge Modules Learning Seminar</title>
<meta name="author" content="Anand Deopurkar" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/css/main.css"></head>
<body>
<div id="content" class="content">
<h1 class="title">Mixed Hodge Modules Learning Seminar</h1>
<div class="properties" id="org607c7e2">

</div>

<p>
<b>Please volunteer for speaking in FIRST or the MHM seminar.</b>
</p>
<div id="outline-container-orgeb58060" class="outline-2">
<h2 id="orgeb58060">Calendar (FIRST + MHM)</h2>
<div class="outline-text-2" id="text-orgeb58060">
<p>
Used to be a google calendar; now defunct. 
</p>
</div>
</div>
<div id="outline-container-org8625477" class="outline-2">
<h2 id="org8625477">List of talks and references</h2>
<div class="outline-text-2" id="text-org8625477">
<ol class="org-ol">
<li>Overview of mixed Hodge modules and their applications to geometry (Ben)  
<a href="mhm1.pdf">Notes</a></li>

<li>Classical (pure) Hodge theory (Anand)  
References: Chapter 0 of [Sabbah-Schnell].  
<a href="mhm2-asilata.pdf">Notes 1</a>, <a href="mhm2-anand.pdf">Notes 2</a></li>

<li>D-modules and the Riemann&#x2013;Hilbert correspondence (Asilata)  
References: [Cavazzani] and the references cited there.  
<a href="mhm3.pdf">Notes</a></li>

<li>Perverse sheaves (Nicola)</li>

<li>Nearby and vanishing cycles (Anand)  
References: [Sabbah].  
<a href="mhm4.pdf">Notes</a></li>

<li>Degenerations of VHS on curves (Ben)
<a href="mhm5.pdf">Notes</a></li>

<li>Perverse sheaves and the decomposition theorem  
References: [Achar], [deCataldo-Migliorini], [deCataldo], Chapter 8 of [Hotta-Takeuchi-Tanisaki].</li>

<li>Nearby and vanishing cycles and filtered D-modules  
References: Section 9 of [Schnell], Section 2.4 of [Sabbah-2]</li>

<li>Definition of pure Hodge modules  
References: Section 12 of [Schnell] which uses stuff also from Section 10 and 11.</li>

<li>Generic vanishing theory via mixed Hodge modules
References: [Popa-Schnell-1]</li>
</ol>
</div>
</div>
<div id="outline-container-orgfb166e3" class="outline-2">
<h2 id="orgfb166e3">References</h2>
<div class="outline-text-2" id="text-orgfb166e3">
<ol class="org-ol">
<li>[Sabbah-Schnell]: <a href="http://www.cmls.polytechnique.fr/perso/sabbah/MHMProject/mhm.html">Sabbah, Schnell, <b>The MHM project</b></a></li>
<li>[Achar]: <a href="psln.pdf">Achar: <b>Lecture notes on Perverse sheaves</b></a></li>
<li>[Popa-Schnell-1]: <a href="mhmgv.pdf">Popa, Schnell, <b>Generic vanishing theory via mixed Hodge modules</b></a></li>
<li>[deCataldo-Migliorini]: <a href="dcm.pdf">de Cataldo, Migliorini, <b>The decomposition theorem, perverse sheaves, and the topology of algebraic maps</b></a></li>
<li>[deCataldo]: <a href="Cataldo.pdf">de Cataldo, <b>Perverse sheaves in algebraic geometry</b></a></li>
<li>[Hotta-Takeuchi-Tanisaki]: <a href="hottaetal.pdf">Hotta, Takeuchi, Tanisaki <b>D-modules, perverse sheaves, and representation theory</b></a></li>
<li>[Cavazzani]: <a href="D-modules.pdf">Cavazzani, <b>The Riemann&#x2013;Hilbert correspondence</b></a></li>
<li>[Schnell]: <a href="sanya.pdf">Schnell, <b>An overview of Morihiko Saito&rsquo;s theory of mixed Hodge modules</b></a></li>
<li>[Sabbah]: <a href="sabbah_notredame1305.pdf">Sabbah, <b>Vanishing cycles and their algebraic computation</b></a></li>
<li>[Sabbah-2]: <a href="sabbah_luminy07.pdf">Sabbah, <b>Hodge theory, singularities, and D-modules</b></a></li>
</ol>
</div>
</div>
<div id="outline-container-org76a9818" class="outline-2">
<h2 id="org76a9818">What links here?</h2>
<div class="outline-text-2" id="text-org76a9818">
<ul class="org-ul">
<li><a href="../../index.html#ID-d990bcc9-227c-4e82-9e93-512139e14f45">Home</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Created by <a href="mailto:anand.deopurkar@anu.edu.au">Anand Deopurkar</a> using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11).  <a href="https://github.com/deopurkar/deopurkar.github.io">Last modified</a>: 2026-05-30 Sat 14:05.
</div>
</body>
</html>
